const quizData = [
 
  { 
    q: "‘आप घर जाएँगें या पार्क जाएँगे।’ वाक्य संबंधित है-", 
    o: ["(क) संयुक्त वाक्य से", "(ख) सरल वाक्य से", "(ग) मिश्र वाक्य से", "(घ) प्रश्न वाक्य से"], 
    a: "(क) संयुक्त वाक्य से" 
  },
  { 
    q: "‘राम आया; सब प्रसन्न हो गए।’ वाक्य का संयुक्त वाक्य रूपांतरण है-", 
    o: ["(क) राम आया और सब प्रसन्न हो गए।", "(ख) जैसे ही राम आया सभी प्रसन्न हो गए।", "(ग) राम के आते ही सभी प्रसन्न हो गए।", "(घ) उपरोक्त कोई नहीं"], 
    a: "(क) राम आया और सब प्रसन्न हो गए।" 
  },
  { 
    q: "‘ उसने पिज्जा खाया और चक्कर खाकर गिर पड़ा’ वाक्य का मिश्र वाक्य रूपांतरण होगा-", 
    o: ["(क) उसने जैसे ही पिज्जा खाया, वैसे ही चक्कर खाकर गिर पड़ा।", "(ख) पिज्जा खाते ही वह चक्कर खाकर गिर पड़ा।", "(ग) वह पिज्जा खाकर चकराकर गिर पड़ा।", "(घ) पिज्जा वह जैसे ही खाया चक्कर खाकर गिर पड़ा।"], 
    a: "(क) उसने जैसे ही पिज्जा खाया, वैसे ही चक्कर खाकर गिर पड़ा।" 
  },
  { 
    q: "‘राधा दौड़कर मेरे पास आई।’ वाक्य का संयुक्त रूप है-", 
    o: ["(क) राधा दौड़ी और मेरे पास आई।", "(ख ) राधा तेजी से दौड़कर मेरे पास आयेगी।", "(ग) राधा जल्दी-जल्दी दौड़ी एवं मेरे पास आई।", "(घ) राधा जैसे ही दौड़ी मेरे पास आ आई।"], 
    a: "(क) राधा दौड़ी और मेरे पास आई।" 
  },
  { 
    q: "‘ममता आई और चली गई। वाक्य का सरल रूप निम्न विकल् पों से चुनें-", 
    o: ["(क) जैसे ही ममता आई वह चली गई।", "(ख) ममता आई और गई।", "(ग) ममता आकर चली गई।", "(घ) ममता आई और खड़े-खड़े चली गई।"], 
    a: "(ग) ममता आकर चली गई।" 
  },
  { 
    q: "‘कमाने वाला खाएगा।’ वाक्य का मिश्र वाक्य में रूप ह ोगा-", 
    o: ["(क) कमाने वाला ही खाता है।", "(ख) कमाने वाला ही खाएगा।", "(ग) जैसे ही वह कमाएगा तबसे खाएगा।", "(घ) जो कमाएगा वह खाएगा।"], 
    a: "(घ) जो कमाएगा वह खाएगा।" 
  },
  { 
    q: "‘जब मजदूरों ने अपना काम पूरा कर लिया तब वे चले गए।’ व ाक्य का संयुक्त रूप है-", 
    o: ["(क) मजदूर अपना काम पूरा कर के चले गए।", "(ख) मजदूरों ने अपना काम पूरा किया और वे चले गए।", "(ग) जैसे ही मजदूरों ने अपना काम पूरा कर लिया वे चले गए।", "(घ) मजदूरों ने  अपना कार्य किया और चले गए।"], 
    a: "(ख) मजदूरों ने अपना काम पूरा किया और वे चले गए।" 
  },
  { 
    q: "‘सांझ हुई और पक्षी घोंसले में आ गए।’ वाक्य का मिश्र वाक्य रूपांतरण है-", 
    o: ["(क) जैसे ही सांझ हुई पक्षी घोंसले में आ गए।", "(ख) शाम होते ही पक्षी घों सले में आ गए।", "(ग) सांझ को पक्षी घोसले में आ गए।", "(घ) उपरोक्त कोई नहीं"], 
    a: "(क) जैसे ही सांझ हुई पक्षी घोंसले में आ गए।" 
  },
  { 
    q: "‘जैसे ही सिपाही ने इशारा किया गाड़ी चल दी।’ वाक्य का भेद है-", 
    o: ["(क) सरल वाक्य", "(ख) मिश्र वाक्य", "(ग) संयु क्त वाक्य", "(घ) देशज वाक्य"], 
    a: "(ख) मिश्र वाक्य" 
  },
  { 
    q: "‘आपके इसलिए अच्छे अंक गए क्योंकि अपने कड़ी मेहनत की थी।’ वाक्य किस भेद से संबंधित है?", 
    o: ["(क) मिश्र वाक्य", "(ख) संयुक्त वाक्य", "(ग) सरल वाक्य", "(घ) आश्र ित वाक्य"], 
    a: "(क) मिश्र वाक्य" 
  },
  { 
    q: "‘सत्य बोलो, परंतु कटु सत्य न बोलो।’ वाक्य संबंधित है-", 
    o: ["(क) मिश्र वाक्य", "(ख) सरल वाक्य", "(ग) संयुक्त वाक्य", "(घ) कटु वाक्य"], 
    a: "(ग) संयुक्त वाक्य" 
  },
  { 
    q: "‘आप पानी पिएँगे अथवा जूस।’ वा क्य का भेद है-", 
    o: ["(क) सरल वाक्य", "(ख) मिश्र वाक्य", "(ग) संयुक्त वाक्य", "(घ) प्रश्नवाचक वाक्य"], 
    a: "(ग) संयुक्त वाक्य" 
  },
  { 
    q: "‘पुष्प खिले, सभी प्रसन्न हो गए।’ वाक्य का संयुक्त वाक्य में रूपांतरण है-", 
    o: ["(क) पुष्प के  खिलते ही सभी प्रसन्न हो गए।", "(ख) जैसे ही पुष्प खिले सभी प्रसन्न हो गए।", "(ग) पुष्प खिले और सभी प्रसन्न हो गए।", "(घ) इन में से कोई नहीं"], 
    a: "(ग) पुष्प खिले और सभी प्रसन्न हो गए।" 
  },
  { 
    q: "‘सुमेश ने फुटबॉल खेला और चला गया।’ व ाक्य का सरल रूप है-", 
    o: ["(क) सुमेश फुटबॉल खेलते-खेलते चला गया।", "(ख) सुमेश फुटबॉल का खेल खेलकर चला गया।", "(ग) सुमेश फुटबॉल खेलकर कर चला गया।", "(घ) सुमेश फुटबॉल खेलते ही चला गया।"], 
    a: "(ग) सुमेश फुटबॉल खेलकर कर चला गया।" 
  },
  { 
    q: "‘लाभदायक कार्य करो।’ वाक्य का मिश्र वाक्य रूपांतरण होगा-", 
    o: ["(क) लाभ वाला कार्य करो।", "(ख) वही कार्य करो जो लाभदायक हो।", "(ग) लाभ वाला कार्य ही करो।", "(घ) ऐसा कार्य करो जिसमें लाभ हो।"], 
    a: "(घ) ऐसा कार्य करो जिसमें लाभ हो।" 
  },
  { 
    q: "‘नीरजा प्रेम प्रकाश त्रिवेदी के पास गई क्योंकि उसे अपनी हिंदी भाषा में सुधार करना है।’ वाक्य का संयुक्त वाक्य रूपांतरण होगा-", 
    o: ["(क) नीरजा अपनी हिंदी भाषा में सुधार करने प्रेम प ्रकाश त्रिवेदी के पास गई।", "(ख) प्रेम प्रकाश त्रिवेदी के पास नीरजा अपनी हिंदी भाषा में सुधार के लिए गई।", "(ग) प्रेम प्रकाश त्रिवेदी के पास नीरजा इसलिए गई क्योंकि उसे अपनी हिंदी भाषा मे ं सुधार करना था।", "(घ) नीरजा को अपनी हिंदी भाषा में सुधार करना है इसलिए वह प्रेम प्रकाश त्रिवेदी के पास गई।"], 
    a: "(ग) प्रेम प्रकाश त्रिवेदी के पास नीरजा इसलिए गई क्योंकि उसे अपनी हिंदी भाषा मे ं सुधार करना था।" 
  },
  { 
    q: "‘गिलास नीचे गिरा और टूट गया।’ वाक्य संयुक्त वाक्य रूपांतरण हो गा-", 
    o: ["(क) गिलास नीचे गिरा और टूट गया।।", "(ख) गिलास नीचे गिरकर टूट गया।", "(ग) गिलास नीचे गिरते ही टूट गया।", "(घ) जैसे ही गिलास नीचे गिरा वह टूट गया।"], 
    a: "(ख) गिलास नीचे गिरकर टूट गया।" 
  },
  { 
    q: "‘अंकित की कलम छूटकर गिर गई। ’ वाक्य संयुक्त वाक्य रूपांतरण होगा-", 
    o: ["(क) अंकित की कलम छूटते ही गिर गई।", "(ख) अंकित की कलम छूटकर गिर गई।", "(ग) अंकित की कलम छूटी और गिर गई।", "(घ) जैसे ही अंकित की कलम छूटी वह गिर गई।"], 
    a: "(ग) अंकित की कलम छूटी और गिर गई।" 
  },
  { 
    q: "‘बादल घिरे और मोर नाचने लगा।’ वाक्य संबंधित है-", 
    o: ["(क) संयुक्त वाक्य से", "(ख) सरल वाक्य से", "(ग) मिश्र वाक्य से", "(घ) प्रश्न वाक्य से"], 
    a: "(क) संयुक्त वाक्य से" 
  },
  { 
    q: "‘राम प्रथम आते ही खेलने लगा।’ वा क्य का संयुक्त वाक्य रूपांतरण है-", 
    o: ["(क) राम प्रथम आया और खेलने लगा।", "(ख) जैसे ही राम प्रथम आया वह खेलने लगा।", "(ग) राम के प्रथम आते ही वह खेलने लगा।", "(घ) उपरोक्त कोई नहीं"], 
    a: "(क) राम प्रथम आया और खेलने लगा।" 
  },
  { 
    q: "‘त ुम पढ़कर सो जाना।’ वाक्य का मिश्र वाक्य रूपांतरण होगा-", 
    o: ["(क) जब तुम पढ़ लोगे तब सो जाना।", "(ख) तुम पढ़ना और सो जाना।", "(ग) वह पढ़कर सो गया।", "(घ) जैसे ही उसने पढ़ा वह सो गया।"], 
    a: "(क) जब तुम पढ़ लोगे तब सो जाना।" 
  },
  { 
    q: "‘सूरज के निकलते ही फूल खिल उठे।’ वाक्य का संयुक्त रूप है-", 
    o: ["(क) सूरज निकला और फूल खिल उठे।", "(ख) सूरज के निकलते ही फूल खिल उठे।", "(ग) सूरज के निकलने के कारण  फूल खिल गए।", "(घ) जैसे ही सूरज निकला फूल खिल गए।"], 
    a: "(क) सूरज निकला और फूल खिल उठे।" 
  },
  { 
    q: "‘दीपक आया और खेलने लगा।’ वाक्य का सरल रूप निम्न विकल्पों से चुनें-", 
    o: ["(क) जैसे ही दीपक आया वह खेलने लगा।", "(ख) दीपक आया और  खेलने लगा।", "(ग) दीपक आकर खेलने लगा।", "(घ) दीपक आया और खेल कर चला लगा।"], 
    a: "(ग) दीपक आकर खेलने लगा।" 
  },
  { 
    q: "‘अंकित की कलम छूटकर गिर गई।’ वाक्य का मिश्र वाक्य में रूप होगा-", 
    o: ["(क) अंकित की कलम छूटी और गिर गई। ", "(ख) अंकित की कलम जैसे ही छूटी वह गिर गई।", "(ग) जो कलम छूटकर गिर गई वह अंकित की है।", "(घ) जो कलम अंकित से छूटी, वह गिर गई।"], 
    a: "(घ) जो कलम अंकित से छूटी, वह गिर गई।" 
  },
  { 
    q: "‘सूरज पढ़-लिखकर अधिकारी बना।’ वाक्य का संयुक् त रूप है-", 
    o: ["(क) सूरज पढ़-लिखकर बड़ा अधिकारी बन गया।", "(ख) सूरज पढ़ा-लिखा और अधिकारी बना।", "(ग) सूरज पढ़-लिखकर अधिकारी बना।", "(घ) पढ़-लिखकर जो अधिकारी बना वह सूरज था।"], 
    a: "(ख) सूरज पढ़ा-लिखा और अधिकारी बना।" 
  },
  { 
    q: "‘मधुरि मा कपडे खरीदने बाजार गई।’ वाक्य संबंधित है-", 
    o: ["(क) संयुक्त वाक्य से", "(ख) सरल वाक्य से", "(ग) मिश्र वाक्य से", "(घ) प्रश्न वाक्य से"], 
    a: "(ख) सरल वाक्य से" 
  },
  { 
    q: "‘यद्यपि मैं अच्छा खेला, फिर भी हार गया।’ वा क्य का संयुक्त वाक्य रूपांतरण है-", 
    o: ["(क) मैं अच्छा खेला, किन्तु हार गया।", "(ख) जैसे ही मैं अच्छा खेला, वैसे ही मैं हार गया।", "(ग) मेरे अच्छा खेलाने के बावजूद भी मैं हार गया।", "(घ) मैं खेला,  हार गया।"], 
    a: "(क) मैं अच्छा खेला, किन्तु हार गया।" 
  },
  { 
    q: "‘पाठ समाप्त हुआ और घंटी बज गई’ वाक्य का मिश्र वाक्य रूपांतरण होगा-", 
    o: ["(क) पाठ समाप्त हुआ , घंटी बजी।", "(ख) जैसे ही पाठ समाप्त हुआ वैसे ही घंटी बज गई।", "(ग) पाठ क े समाप्त होते ही घंटी बज गई।", "(घ) पाठ को समाप्त किया गया फिर घंटी बज गई।"], 
    a: "(ख) जैसे ही पाठ समाप्त हुआ वैसे ही घंटी बज गई।" 
  },
  { 
    q: "‘जैसे ही बिजली गई वैसे ही टी.वी. बंद हो गया।’ वाक्य का संयुक्त रूप है-", 
    o: ["(क) जैसे ही बिजली गई  टी.वी. तुरंत बंद हो गया।", "(ख) बिजली गई, टी.वी. बंद हो गया।", "(ग) बिजली जाते ही टी.वी. बंद हो गया।", "(घ) जैसे ही बिजली गई टी.वी. का बंद होना स्वाभाविक था।"], 
    a: "(ग) बिजली जाते ही टी.वी. बंद हो गया।" 
  },
  { 
    q: "‘जब लाइनमैन ने  टूटी हुई तारों को जोड़ दिया तब वह चला गया।’ वाक्य का सरल रूप निम्न विकल्पों से चुनें-", 
    o: ["(क) लाइनमैन टूटे तार जोड़ कर चला गया।", "(ख) लाइनमैन ने टूटी हुई तारों को जोड़ा और चला गया।", "(ग) ट ूटी हुई तारों को जोड़ कर लाइनमैन चला गया।", "(घ) जैसे ही लाइनमैन ने टूटी हुई तारों को जोड़ दिया वैसे ही वह चला गया।"], 
    a: "(क) लाइनमैन टूटे तार जोड़ कर चला गया।" 
  },
  { 
    q: "‘किसान फावड़ा उठा कर खेत को चला गया।’ वाक्य का मिश् र वाक्य में रूप होगा-", 
    o: ["(क) किसान ने फावड़ा उठाया और तुरन्त खेत की ओर चला गया।", "(ख) खेत को जाने से पहले किसान ने फावड़ा उठा लिया।", "(ग) किसान ने फावड़ा उठाया और खेत को चला गया।", "(घ) जब क िसान ने फावड़ा उठा लिया तब वह खेत को चला गया।"], 
    a: "(घ) जब क िसान ने फावड़ा उठा लिया तब वह खेत को चला गया।" 
  },
  { 
    q: "‘वह ऐसा मेहनती है जो पराजय स्वीकार नहीं करता।’ वाक्य का संयुक्त रूप है-", 
    o: ["(क) वह ऐसा मेहनती है, अतः वह पराजय स्वीकार नही ं करता।", "(ख) वह इतना मेहनती है कि कभी भी अपनी पराजय स्वीकार नहीं करता।", "(ग) वह पराजय स्वीकार नहीं करता क्योंकि वह बहुत मेहनती है ।", "(घ) वह मेहनती है किन्तु पराजय स्वीकार नहीं करता।"], 
    a: "(क) वह ऐसा मेहनती है, अतः वह पराजय स्वीकार नही ं करता।" 
  }
  ];
  
let currentQuestionIndex = 0;
let score = 0;

const questionElement = document.getElementById("question");
const optionsContainer = document.getElementById("options");
const nextButton = document.getElementById("next-btn");
const resultBox = document.getElementById("result-box");
const scoreElement = document.getElementById("score");

function loadQuestion() {
    const currentQuestion = quizData[currentQuestionIndex];
    questionElement.textContent = `${currentQuestionIndex + 1}. ${currentQuestion.q}`;
    optionsContainer.innerHTML = "";
    
    currentQuestion.o.forEach(option => {
        const button = document.createElement("button");
        button.textContent = option;
        button.classList.add("option");
        button.addEventListener("click", () => checkAnswer(button, currentQuestion.a));
        optionsContainer.appendChild(button);
    });

    nextButton.style.display = "none";
}

function checkAnswer(selectedButton, correctAnswer) {
    const buttons = document.querySelectorAll(".option");
    buttons.forEach(button => button.disabled = true);
    
    if (selectedButton.textContent === correctAnswer) {
        selectedButton.classList.add("correct");
        score++;
    } else {
        selectedButton.classList.add("wrong");
        buttons.forEach(button => {
            if (button.textContent === correctAnswer) button.classList.add("correct");
        });
    }
    
    nextButton.style.display = "block";
}

nextButton.addEventListener("click", () => {
    currentQuestionIndex++;
    if (currentQuestionIndex < quizData.length) {
        loadQuestion();
    } else {
        showResult();
    }
});

function showResult() {
    document.getElementById("quiz-box").classList.add("hide");
    resultBox.classList.remove("hide");
    scoreElement.textContent = score;
}

function restartQuiz() {
    currentQuestionIndex = 0;
    score = 0;
    resultBox.classList.add("hide");
    document.getElementById("quiz-box").classList.remove("hide");
    loadQuestion();
}

loadQuestion();

